/**
 * @Description: gio上报文案汇总
 */
define("dist/cmd-lib/gioInfo-debug", [], function(require, exports, module) {
    var gioInfo = {
        //下载失败受限上传文案
        downloadLimitedCodeMap: {
            "-1": "下载限制黑名单",
            "-2": "文件不存在",
            "-3": "私有文件",
            "-4": "只读",
            "1": "已超过了当日下载量",
            "2": "当日下载过于频繁",
            "3": "下载券积分不足",
            "4": "下载券不足兑换积分",
            "5": "下载券足够",
            "8": "未购买",
            "9": "下载特权足够",
            "10": "用户不是vip不能下",
            "12": "vip专享下载—扣除下载特权",
            "13": "vip专享下载—扣除下载特权但不够扣",
            "98": "显示图形验证码",
            "99": "校验图形验证码不通过"
        },
        downloadConsumeMap: {
            "1": "下载券",
            "2": "下载特权",
            "3": "积分",
            "4": "VIP免费",
            "5": "本人文件",
            "6": "现金",
            "7": "已下载过",
            "8": "免费"
        }
    };
    module.exports = gioInfo;
});